// import Card from './Card';
import CardList from './CardList';

export default function Main() {
  const theoryCards = [
    {
      title: 'Компоненти в React',
      text: 'Це незалежні частини інтерфейсу, які можна повторно використовувати.',
    },
    {
      title: 'Композиція',
      text: 'Дає змогу комбінувати компоненти для створення складніших UI-структур.',
    },
    {
      title: 'Вкладені компоненти',
      text: 'Компоненти можуть містити інші компоненти.',
    },
  ];

  const practiceCards = [
    {
      title: 'CardList компонент',
      text: 'Створи компонент, який рендерить кілька карток за допомогою .map().',
    },
    {
      title: 'Props',
      text: 'Передавай дані між компонентами через властивості (props).',
    },
    {
      title: 'Композиція компонентів',
      text: 'Об’єднуй прості компоненти, щоб створювати складніші UI.',
    },
  ];
  return (
    <main>
      {/* <Card>
        <h2>Компоненти в React</h2>
        <p>
          Це незалежні частини інтерфейсу, які можна повторно використовувати.
        </p>
      </Card>
      <Card>
        <h2>Композиція</h2>
        <p>
          Дає змогу комбінувати компоненти для створення складніших UI-структур.
        </p>
      </Card>
      <Card>
        <h2>Вкладені компоненти</h2>
        <p>Компоненти можуть містити інші компоненти.</p>
      </Card> */}
      <h2>🧠 Теорія React</h2>
      <CardList cards={theoryCards} />

      <h2>💻 Практика React</h2>
      <CardList cards={practiceCards} />
    </main>
  );
}
